In [1]:
import numpy as np
import pandas as pd

**문제 1**

In [2]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [3]:
((df['retail_price'] - df['wholesale_price']) * df['sales']).sum()

110700.0

In [4]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

(1)
On what products is our markup more than 30% more than the wholesale price?

In [5]:
# See? It's super profitable to be a bookseller!
df['name'][df['retail_price'] * 0.5 > df['wholesale_price']]

1    Python Workout
2    Pandas Workout
Name: name, dtype: object

(2)
How much did the store make from food vs. computers vs. books?  (You can just retrieve based on the index values, not anything more sophisticated.)

In [6]:
# computers
((df['retail_price'] - df['wholesale_price']) * df['sales'])[0].sum()

50000.0

In [7]:
# books
((df['retail_price'] - df['wholesale_price']) * df['sales'])[[1,2]].sum()

60000.0

In [8]:
# food 
((df['retail_price'] - df['wholesale_price']) * df['sales'])[[3,4]].sum()

700.0

(3)
Because your store is doing so well, you're able to negotiate a 30% discount on the wholesale price of goods. Calculate the new net income.

In [9]:
((df['retail_price'] - df['wholesale_price']*0.7) * df['sales']).sum()

141750.0

**문제 2**

In [10]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [11]:
df['current_net'] = ((df['retail_price'] - df['wholesale_price']) * df['sales'])

In [12]:
df

,product_id,name,wholesale_price,retail_price,sales,current_net
0,23,computer,500.0,1000,100,50000.0
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0
3,15,banana,0.5,1,200,100.0
4,87,sandwich,3.0,5,300,600.0

In [13]:
df['after_15'] = df['current_net'] * 0.85
df['after_20'] = df['current_net'] * 0.80
df['after_25'] = df['current_net'] * 0.75

In [14]:
df

,product_id,name,wholesale_price,retail_price,sales,current_net,after_15,after_20,after_25
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0

In [15]:
df[['current_net', 'after_15', 'after_20', 'after_25']].sum()

current_net    110700.0
after_15        94095.0
after_20        88560.0
after_25        83025.0
dtype: float64

In [16]:
df['current_net'].sum() - df[['current_net', 'after_15', 'after_20', 'after_25']].sum()

current_net        0.0
after_15       16605.0
after_20       22140.0
after_25       27675.0
dtype: float64

In [17]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

df['current_net'] = ((df['retail_price'] - df['wholesale_price']) * df['sales'])
df

,product_id,name,wholesale_price,retail_price,sales,current_net
0,23,computer,500.0,1000,100,50000.0
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0
3,15,banana,0.5,1,200,100.0
4,87,sandwich,3.0,5,300,600.0

(1)
An alternative tax plan would charge 25% tax, but only on those products on which we would net more than 20,000. In such a case, how much would we make?

In [18]:
# The short way, using lambda + the inline if-else
df['current_net'].apply(lambda c: c*0.75 if c > 20000 else c).sum()

88200.0

In [19]:
# The longer way, defining a "real" function with a normal if-else
def calculate_tax(c):
    if c > 20000:
        return c * 0.75

    return c

df['current_net'].apply(calculate_tax).sum()

88200.0

(2)
Yet another alternative tax plan would charge 25% tax on products whose retail price is greater than 80, 10% tax on products whose retail price is between 30 and 80, and no tax on others. Implement and calculate the result of such a tax scheme.

In [20]:
# Use pd.cut to set the cutoffs, then translate from category to floats
df['after_tax'] = pd.cut(df['retail_price'], 
                   bins=[0, 30, 80, df['retail_price'].max()],
                   labels=[1, 0.9, 0.75]).astype(np.float64)

df['final_net'] = df['current_net'] * df['after_tax']
df

,product_id,name,wholesale_price,retail_price,sales,current_net,after_tax,final_net
0,23,computer,500.0,1000,100,50000.0,0.75,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,0.90,36000.0
2,97,Pandas Workout,35.0,75,500,20000.0,0.90,18000.0
3,15,banana,0.5,1,200,100.0,1.00,100.0
4,87,sandwich,3.0,5,300,600.0,1.00,600.0

(3)
These long floating-point numbers are getting a bit hard to read. Set the `float_format` option in `pandas` such that the floating-point numbers will be displayed with commas every three digits before the decimal point, and only two digits after the decimal point. Note that this is a bit tricky, in that it requires understanding Python callables and the `str.format` method.

In [21]:
pd.options.display.float_format = '{:,.2f}'.format

In [22]:
df

,product_id,name,wholesale_price,retail_price,sales,current_net,after_tax,final_net
0,23,computer,500.00,1000,100,"50,000.00",0.75,"37,500.00"
1,96,Python Workout,35.00,75,1000,"40,000.00",0.90,"36,000.00"
2,97,Pandas Workout,35.00,75,500,"20,000.00",0.90,"18,000.00"
3,15,banana,0.50,1,200,100.00,1.00,100.00
4,87,sandwich,3.00,5,300,600.00,1.00,600.00

**문제 3**

In [23]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500,
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer           500.00          1000    100
1          96  Python Workout            35.00            75   1000
2          97  Pandas Workout            35.00            75    500
3          15          banana             0.50             1    200
4          87        sandwich             3.00             5    300

In [24]:
new_products = pd.DataFrame([{'product_id':24, 'name':'phone', 'wholesale_price': 200,
                 'retail_price':500},
                        {'product_id':16, 'name':'apple', 'wholesale_price': 0.5,
                 'retail_price':1},
                        {'product_id':17, 'name':'pear', 'wholesale_price': 0.6,
                 'retail_price':1.2}], index=range(5,8))
new_products

   product_id   name  wholesale_price  retail_price
5          24  phone           200.00        500.00
6          16  apple             0.50          1.00
7          17   pear             0.60          1.20

In [25]:
df = pd.concat([df, new_products])
df

   product_id            name  wholesale_price  retail_price    sales
0          23        computer           500.00      1,000.00   100.00
1          96  Python Workout            35.00         75.00 1,000.00
2          97  Pandas Workout            35.00         75.00   500.00
3          15          banana             0.50          1.00   200.00
4          87        sandwich             3.00          5.00   300.00
5          24           phone           200.00        500.00      NaN
6          16           apple             0.50          1.00      NaN
7          17            pear             0.60          1.20      NaN

In [26]:
# Option 1: Set the sales individually
df.loc[5, 'sales'] = 100
df.loc[6, 'sales'] = 200
df.loc[7, 'sales'] = 75

In [27]:
# Option 2: Set the sales in one line
df.loc[[5,6,7], 'sales'] = [100, 200, 75]

In [28]:
# double check that we have everything
df

   product_id            name  wholesale_price  retail_price    sales
0          23        computer           500.00      1,000.00   100.00
1          96  Python Workout            35.00         75.00 1,000.00
2          97  Pandas Workout            35.00         75.00   500.00
3          15          banana             0.50          1.00   200.00
4          87        sandwich             3.00          5.00   300.00
5          24           phone           200.00        500.00   100.00
6          16           apple             0.50          1.00   200.00
7          17            pear             0.60          1.20    75.00

In [29]:
# Total sales of all products, including the new ones
(df['retail_price'] - df['wholesale_price']) * df['sales'].sum()

0   1,237,500.00
1      99,000.00
2      99,000.00
3       1,237.50
4       4,950.00
5     742,500.00
6       1,237.50
7       1,485.00
dtype: float64

In [30]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500,
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])


new_products = pd.DataFrame([{'product_id':24, 'name':'phone', 'wholesale_price': 200,
                 'retail_price':500},
                        {'product_id':16, 'name':'apple', 'wholesale_price': 0.5,
                 'retail_price':1},
                        {'product_id':17, 'name':'pear', 'wholesale_price': 0.6,
                 'retail_price':1.2}], index=range(5,8))

df = pd.concat([df, new_products])
df.loc[[5,6,7], 'sales'] = [100, 200, 75]

df

   product_id            name  wholesale_price  retail_price    sales
0          23        computer           500.00      1,000.00   100.00
1          96  Python Workout            35.00         75.00 1,000.00
2          97  Pandas Workout            35.00         75.00   500.00
3          15          banana             0.50          1.00   200.00
4          87        sandwich             3.00          5.00   300.00
5          24           phone           200.00        500.00   100.00
6          16           apple             0.50          1.00   200.00
7          17            pear             0.60          1.20    75.00

(1)

Add one new product to the data frame, without using `pd.concat`. What's the advantage of `pd.concat`, and when should you use it?

In [31]:
# If you're just adding one row to the data frame, you can assign 
# to df.loc[INDEX].  Assuming that the index doesn't already exist,
# this will add a new row to the data frame.  You can, of course,
# also use df.iloc[INDEX], using a number 1 greater than the current
# max.

# By contrast, pd.concat is for when you want to combine to 
# data frames into a single new one
df.loc[8] = [99, 'persimmon', 2, 4.5, 1]

(2)
Add a new column, `department`, to the data frame. Place each product in a separate department. For example, in our data, we would have three departments: `electronics`, `books`, and `food`. Calculate `current_net` on the data frame, and then show the descriptive statisics for `current_net` for food products.

In [32]:
df['department'] = ['electronics', 'books', 'books', 'food', 'food',
                   'electronics', 'food', 'food', 'food']
df

,product_id,name,wholesale_price,retail_price,sales,department
0,23,computer,500.00,"1,000.00",100.00,electronics
1,96,Python Workout,35.00,75.00,"1,000.00",books
2,97,Pandas Workout,35.00,75.00,500.00,books
3,15,banana,0.50,1.00,200.00,food
4,87,sandwich,3.00,5.00,300.00,food
5,24,phone,200.00,500.00,100.00,electronics
6,16,apple,0.50,1.00,200.00,food
7,17,pear,0.60,1.20,75.00,food
8,99,persimmon,2.00,4.50,1.00,food

In [33]:
df['current_net'] = (df['retail_price'] - df['wholesale_price']) * df['sales'].sum()

# Now use a mask index on current_net
df['current_net'][df['department'] == 'electronics'].describe()

count           2.00
mean      990,400.00
std       350,159.28
min       742,800.00
25%       866,600.00
50%       990,400.00
75%     1,114,200.00
max     1,238,000.00
Name: current_net, dtype: float64

(3)
Now use the `query` method to get the descriptive statistics for food items.

In [34]:
df.query('department == "food"')['current_net'].describe()

count       5.00
mean    3,020.72
std     2,371.02
min     1,238.00
25%     1,238.00
50%     1,485.60
75%     4,952.00
max     6,190.00
Name: current_net, dtype: float64

**문제 4**

In [35]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500,
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer           500.00          1000    100
1          96  Python Workout            35.00            75   1000
2          97  Pandas Workout            35.00            75    500
3          15          banana             0.50             1    200
4          87        sandwich             3.00             5    300

In [36]:
df.loc[df['sales'] > df['sales'].mean(), ['product_id', 'name']]

   product_id            name
1          96  Python Workout
2          97  Pandas Workout

In [37]:
df.query('sales > sales.mean()')

   product_id            name  wholesale_price  retail_price  sales
1          96  Python Workout            35.00            75   1000
2          97  Pandas Workout            35.00            75    500

In [38]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500,
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer           500.00          1000    100
1          96  Python Workout            35.00            75   1000
2          97  Pandas Workout            35.00            75    500
3          15          banana             0.50             1    200
4          87        sandwich             3.00             5    300

(1)

Show the ID and name of those products whose net income is in the top 25% quantile.

In [39]:
df['net'] = df['retail_price'] - df['wholesale_price']
df.loc[df['net'] > df['net'].quantile(0.75), ['product_id', 'name']]

   product_id      name
0          23  computer

In [40]:
# Or if you prefer to use query...
df.query('net > net.quantile(0.75)')[['product_id', 'name']]

   product_id      name
0          23  computer

(2)

Show the ID and name of products that have lower than average sales numbers, and whose wholesale price is greater than the average.

In [41]:
df.loc[(df['sales'] < df['sales'].mean()) &
       (df['wholesale_price'] > df['wholesale_price'].mean()), ['product_id', 'name']]

   product_id      name
0          23  computer

In [42]:
# In a case like this one, query looks much more readable
df.query('sales < sales.mean() & wholesale_price > wholesale_price.mean()')[['product_id', 'name']]

   product_id      name
0          23  computer

(3)

Show the names, wholesale price, and retail price of products with product IDs between 80 and 100, and which sold fewer than 400 units.

In [43]:
df.loc[(df['product_id'] > 80) & (df['product_id'] < 100) & (df['sales'] < 400),
       ['name', 'wholesale_price', 'retail_price']]

       name  wholesale_price  retail_price
4  sandwich             3.00             5

In [44]:
# and with query...

df.query('product_id > 80 & product_id < 100 & sales < 400')[['name', 'wholesale_price', 'retail_price']]

       name  wholesale_price  retail_price
4  sandwich             3.00             5

**문제 5**

In [45]:
base_url = 'https://raw.githubusercontent.com/codingalzi/datapy/master/practices/data/'

In [46]:
trip_distance = pd.read_csv(base_url + 'taxi-distance.csv', header=None).squeeze()
passenger_count = pd.read_csv(base_url + 'taxi-passenger-count.csv', header=None).squeeze()

df = pd.DataFrame({'trip_distance': trip_distance,
                'passenger_count': passenger_count})

In [47]:
df.head(10)

   trip_distance  passenger_count
0           1.63                1
1           0.46                1
2           0.87                1
3           2.13                1
4           1.40                1
5           1.40                1
6           1.80                1
7          11.90                4
8           1.27                1
9           0.60                1

In [48]:
iqr = df['trip_distance'].quantile(0.75) - df['trip_distance'].quantile(0.25)

In [49]:
# outlier distances -- below
df[df['trip_distance'] < df['trip_distance'].quantile(0.25) - 1.5*iqr]

Empty DataFrame
Columns: [trip_distance, passenger_count]
Index: []

In [50]:
# outlier distances -- above
df[df['trip_distance'] > df['trip_distance'].quantile(0.25) + 1.5*iqr]

      trip_distance  passenger_count
7             11.90                4
39             5.28                2
43             5.30                2
56             4.71                1
60             9.30                1
...             ...              ...
9990           6.07                1
9992           6.37                1
9995           4.50                1
9996           5.59                1
9998           5.80                1

[1889 rows x 2 columns]

In [51]:
# mean passenger count for outliers
df['passenger_count'][df['trip_distance'] > df['trip_distance'].quantile(0.25) + 1.5*iqr].mean()

1.6966649020645845

In [52]:
df['passenger_count'].mean()

1.6594659465946595

(1)

If we define outliers to be the lowest 10% and highest 10% of values, then how many are they? Why is (or isn't) this a good measure?

In [53]:
df[(df['trip_distance'] < df['trip_distance'].quantile(0.1)) | 
   (df['trip_distance'] > df['trip_distance'].quantile(0.9)) ]

      trip_distance  passenger_count
1              0.46                1
7             11.90                4
9              0.60                1
10             0.01                3
13             0.50                2
...             ...              ...
9976          12.60                1
9978           0.38                1
9979          11.30                1
9980           9.13                1
9982           9.30                1

[1984 rows x 2 columns]

The good news with this measure is that it's easy to understand. The bad news is that if we have many short trips (as we do here), we might end up calling them outliers even though they're very close in value to non-outliers.

(2)

How many short, medium, and long trips were there for trips that had only one passenger? Note that data for passenger count and trip length are from the same data set, meaning that the indexes are the same.

If we're only interested in removing the non-outlier values, then we could use the `scipy.stats.trimboth` function on our series. It takes a second argument, the proportion we want to cut from both the top and bottom.

In [54]:
from scipy.stats import trimboth
trimboth(df['trip_distance'], 0.1)

array([0.63, 0.63, 0.63, ..., 8.2 , 8.2 , 8.2 ])

(3)

The `scipy.stats.zscore` function rescales and centers (i.e., normalizes) our data set. Our mean is set to 0, values can be above and below that value. Find all of the distances for which the absolute value of the z-score is greater than 3.

In [55]:
from scipy.stats import zscore
df['trip_distance'][abs(zscore(df['trip_distance'])) > 3]

88     23.76
238    18.32
379    16.38
509    16.82
641    19.72
        ...
9897   16.11
9899   17.48
9906   17.70
9955   15.49
9964   18.55
Name: trip_distance, Length: 306, dtype: float64

**문제 6**

In [56]:
s = pd.read_csv(base_url + 'nyc-temps.txt').squeeze()
df = pd.DataFrame({'temp': s, 
                'hour': [0,3,6,9,12,15,18,21] * 91})

In [57]:
# Get the mean + median for baseline data
df['temp'].describe()

count   728.00
mean     -1.05
std       5.03
min     -14.00
25%      -4.00
50%       0.00
75%       2.00
max      12.00
Name: temp, dtype: float64

In [58]:
df

     temp  hour
0      -1     0
1      -1     3
2      -1     6
3      -1     9
4      -1    12
..    ...   ...
723     2     9
724     2    12
725     2    15
726     2    18
727     2    21

[728 rows x 2 columns]

In [59]:
# Set temp at 3 and 6 a.m. to NaN
df.loc[(df['hour'] == 3) | (df['hour'] == 6), 'temp'] = np.NaN

In [60]:
df

     temp  hour
0   -1.00     0
1     NaN     3
2     NaN     6
3   -1.00     9
4   -1.00    12
..    ...   ...
723  2.00     9
724  2.00    12
725  2.00    15
726  2.00    18
727  2.00    21

[728 rows x 2 columns]

In [61]:
# Interpolate!
df = df.interpolate()

In [62]:
# Get the mean + median for when we're missing 3 and 6 a.m.
df['temp'].describe()

count   728.00
mean     -1.05
std       5.03
min     -14.00
25%      -4.00
50%       0.00
75%       2.00
max      12.00
Name: temp, dtype: float64

In [63]:
df

     temp  hour
0   -1.00     0
1   -1.00     3
2   -1.00     6
3   -1.00     9
4   -1.00    12
..    ...   ...
723  2.00     9
724  2.00    12
725  2.00    15
726  2.00    18
727  2.00    21

[728 rows x 2 columns]

In [64]:
df = df[:7].copy()

In [65]:
df

   temp  hour
0 -1.00     0
1 -1.00     3
2 -1.00     6
3 -1.00     9
4 -1.00    12
5 -1.00    15
6 -1.00    18

In [66]:
df['temp'] = [-1, np.nan, np.nan, 5, -1, np.nan, 3]

In [67]:
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

In [68]:
df.loc[6] = [3, 18]

In [69]:
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

In [70]:
df = df.copy()

In [71]:
df.loc[:, 'temp'] = [-1, np.nan, np.nan, 5, -1, np.nan, 3]

In [72]:
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

In [73]:
df.interpolate()

   temp  hour
0 -1.00     0
1  1.00     3
2  3.00     6
3  5.00     9
4 -1.00    12
5  1.00    15
6  3.00    18

In [74]:
df.head(15).to_dict()

{'temp': {0: -1.0, 1: nan, 2: nan, 3: 5.0, 4: -1.0, 5: nan, 6: 3.0},
 'hour': {0: 0, 1: 3, 2: 6, 3: 9, 4: 12, 5: 15, 6: 18}}

In [75]:
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

In [76]:
df.loc[(df['hour'] == 3) | (df['hour'] == 6), 'temp'] = np.nan
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

(1)

By default, the `interpolate` method tries to average the remaining values before and after any `NaN`. However, we can change how it works, by passing `method='nearest'`. Does that change our data substantially?

In [77]:
# No, doesn't seem to change things significantly -- maybe because temperatures
# don't really vary all that much across readings.

df.interpolate(method='nearest').describe()

       temp  hour
count  7.00  7.00
mean   1.29  9.00
std    2.93  6.48
min   -1.00  0.00
25%   -1.00  4.50
50%   -1.00  9.00
75%    4.00 13.50
max    5.00 18.00

(2)

Let's assume that the equipment works fine around the clock, but that it fails to record a reading at -1 degree and below. Are the interpolated values similar to the real (missing) values they replace? Why or why not?

In [78]:
# reset our data
df = pd.DataFrame({'temp': s, 
                'hour': [0,3,6,9,12,15,18,21] * 91})

In [79]:
# Remove values <= -1 to NaN
df.loc[df['temp'] <= -1, 'temp'] = np.nan

In [80]:
# Interpolate!
df = df.interpolate()

In [81]:
# Wow, the mean is now 2 and the median is now 1 -- significantly higher
# Not surprising, of course, given that we removed all very low temperatures!
df['temp'].describe()

count   721.00
mean      2.02
std       2.35
min       0.00
25%       0.21
50%       1.00
75%       3.00
max      12.00
Name: temp, dtype: float64

(3)

A cheap solution to interpolation is to replace `NaN` values with the column's mean. Do this, and compare the new mean and median. Again, why are (or aren't) these values similar to the original ones?

In [82]:
# reset our data
df = pd.DataFrame({'temp': s, 
                'hour': [0,3,6,9,12,15,18,21] * 91})

# Remove values <= -1 to NaN
df.loc[df['temp'] <= -1, 'temp'] = np.nan

df = df.fillna(df.mean())

In [83]:
# Wow, these values are even worse than the interpolated ones!

# Clearly, running .interpolate is a better option than using the mean -- 
# in no small part because it calculated a local mean, rather than
# a global one across all of the data.

df.describe()

        temp   hour
count 728.00 728.00
mean    2.76  10.50
std     1.94   6.88
min     0.00   0.00
25%     2.00   5.25
50%     2.76  10.50
75%     2.76  15.75
max    12.00  21.00

**문제 7**

In [84]:
s = pd.read_csv(base_url+'nyc-temps.txt').squeeze()
df = pd.DataFrame({'temp': s, 
                'hour': [0,3,6,9,12,15,18,21] * 91})

In [85]:
df.loc[df['temp'] < 0, 'temp']  = 0

In [86]:
df.describe()

        temp   hour
count 728.00 728.00
mean    1.43  10.50
std     2.38   6.88
min     0.00   0.00
25%     0.00   5.25
50%     0.00  10.50
75%     2.00  15.75
max    12.00  21.00

(1)

Set all of the odd temperatures to the mean of all temperatures

In [87]:
df.loc[df['temp']%2 == 1, 'temp'] = df['temp'].mean()

In [88]:
df

     temp  hour
0    0.00     0
1    0.00     3
2    0.00     6
3    0.00     9
4    0.00    12
..    ...   ...
723  2.00     9
724  2.00    12
725  2.00    15
726  2.00    18
727  2.00    21

[728 rows x 2 columns]

(2)

Set the even temperatures at hours 9 and 18 to 3

In [89]:
df.loc[(df['hour'] == 9) | 
       (df['hour'] == 18), 'temp'] = 3

In [90]:
df

     temp  hour
0    0.00     0
1    0.00     3
2    0.00     6
3    3.00     9
4    0.00    12
..    ...   ...
723  3.00     9
724  2.00    12
725  2.00    15
726  3.00    18
727  2.00    21

[728 rows x 2 columns]

(3)

If the hour is odd, then set the temperature to 5

In [91]:
df.loc[df['hour']%2 == 1, 'temp'] = 5

In [92]:
df

     temp  hour
0    0.00     0
1    5.00     3
2    0.00     6
3    5.00     9
4    0.00    12
..    ...   ...
723  5.00     9
724  2.00    12
725  5.00    15
726  3.00    18
727  5.00    21

[728 rows x 2 columns]